perf-tests-jmeter/plans/11-waiting-room-first-hit.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="11 - Waiting Room First-Hit" enabled="true">
      <stringProp name="TestPlan.comments">CF Waiting Room first-hit measurement — 250 threads burst, classify ACTIVE vs QUEUE on first request, poll until slot acquired</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ═══ User Defined Variables ═══ -->
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Environment Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">${__P(BASE_URL,https://formsystem.softdebut.online)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="LOAD_TEST_TOKEN" elementType="Argument">
            <stringProp name="Argument.name">LOAD_TEST_TOKEN</stringProp>
            <stringProp name="Argument.value">${__P(LOAD_TEST_TOKEN,dev-token)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="VUS" elementType="Argument">
            <stringProp name="Argument.name">VUS</stringProp>
            <stringProp name="Argument.value">${__P(VUS,250)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="POLL_TIMEOUT" elementType="Argument">
            <stringProp name="Argument.name">POLL_TIMEOUT</stringProp>
            <stringProp name="Argument.value">${__P(POLL_TIMEOUT,180)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>

      <!-- ═══ HTTP Request Defaults ═══ -->
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <stringProp name="HTTPSampler.domain">${__groovy(vars.get("BASE_URL").replaceAll("https?://"\,""))}</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- ═══ HTTP Header Manager ═══ -->
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">X-Load-Test-Token</stringProp>
            <stringProp name="Header.value">${LOAD_TEST_TOKEN}</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">text/html</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <!-- ═══ HTTP Cookie Manager — per-thread, DO NOT clear each iteration ═══ -->
      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
        <collectionProp name="CookieManager.cookies"/>
        <boolProp name="CookieManager.clearEachIteration">false</boolProp>
        <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
      </CookieManager>
      <hashTree/>

      <!-- ═══ Init counter props (once) ═══ -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp - Init Counters" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true">
          <intProp name="LoopController.loops">1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Init Props" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
props.put("active_first_hit", "0")
props.put("queue_first_hit", "0")
props.put("cf_native_wr_hits", "0")
props.put("queue_to_active", "0")
props.put("queue_timeout", "0")
props.put("submit_waiting_room_hits", "0")
props.put("results_dir", "results")
log.info("WR counters initialized")
          </stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>

      <!-- ═══════════════════════════════════════════════════════════════════ -->
      <!-- Main Thread Group: VUS threads, ramp 0s, loop 1                   -->
      <!-- ═══════════════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="WR First-Hit Burst" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true">
          <intProp name="LoopController.loops">1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${VUS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>

        <!-- CSV Data Set: random form type -->
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Form Types" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">data/form-types-all.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">form_type</stringProp>
        </CSVDataSet>
        <hashTree/>

        <!-- JSR223 PreProcessor: unique id -->
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Generate Unique ID" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="filename">groovy/unique-id.groovy</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <!-- ── Step 1: GET / (index page) ── -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET / (index)" enabled="true">
          <stringProp name="HTTPSampler.path">/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <!-- ── Step 2: GET /form/${form_type} — FIRST HIT (1-2s think time before) ── -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /form/${form_type} (FIRST HIT)" enabled="true">
          <stringProp name="HTTPSampler.path">/form/${form_type}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Think 1-2s before first-hit (scoped to this sampler only) -->
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think 1-2s" enabled="true">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
            <stringProp name="RandomTimer.range">1000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
          <!-- Detect WR (PostProcessor) -->
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Detect WR (first-hit)" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="filename">groovy/detect-wr.groovy</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>

        <!-- ════════════════════════════════════════════════════ -->
        <!-- ACTIVE path: think → submit → done                  -->
        <!-- ════════════════════════════════════════════════════ -->
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If ACTIVE" enabled="true">
          <stringProp name="IfController.condition">${__groovy(vars.get("is_queued") == "false")}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>

          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think 2-4s (post-first-hit)" enabled="true">
            <stringProp name="ConstantTimer.delay">2000</stringProp>
            <stringProp name="RandomTimer.range">2000</stringProp>
          </UniformRandomTimer>
          <hashTree/>

          <!-- Build payload (shared file: groovy/build-payload.groovy) -->
          <!-- Also sets submit_think_min_ms / submit_think_range_ms based on has_file -->
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Build Submit Payload" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="filename">groovy/build-payload.groovy</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>

          <!-- Second think time (matches k6 submitAndCheck): 2-5s non-file, 3-7s with file -->
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Submit Think (dynamic)" enabled="true">
            <stringProp name="ConstantTimer.delay">${submit_think_min_ms}</stringProp>
            <stringProp name="RandomTimer.range">${submit_think_range_ms}</stringProp>
          </UniformRandomTimer>
          <hashTree/>

          <!-- POST /submit/${form_type} -->
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /submit/${form_type} (active)" enabled="true">
            <stringProp name="HTTPSampler.path">/submit/${form_type}</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="fullName" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.name">fullName</stringProp><stringProp name="Argument.value">${full_name}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp></elementProp>
                <elementProp name="email" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.name">email</stringProp><stringProp name="Argument.value">${email}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp></elementProp>
                <elementProp name="phone" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.name">phone</stringProp><stringProp name="Argument.value">${phone}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp></elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <!-- Dynamically attach extra fields + file -->
            <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Attach Extra Fields + File" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="filename">groovy/attach-fields.groovy</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PreProcessor>
            <hashTree/>

            <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Assert submit + count WR-blocked" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="filename">groovy/submit-assert.groovy</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223Assertion>
            <hashTree/>
          </hashTree>

        </hashTree>

        <!-- ════════════════════════════════════════════════════ -->
        <!-- QUEUE path: poll until slot acquired → submit        -->
        <!-- ════════════════════════════════════════════════════ -->
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If QUEUED" enabled="true">
          <stringProp name="IfController.condition">${__groovy(vars.get("is_queued") == "true")}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>

          <!-- Record start time for timeout -->
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Record Poll Start Time" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">
vars.put("poll_start", String.valueOf(System.currentTimeMillis()))
vars.put("still_waiting", "true")
            </stringProp>
          </JSR223PreProcessor>
          <hashTree/>

          <!-- While loop: poll GET /form/${form_type} until not WR -->
          <WhileController guiclass="WhileControllerGui" testclass="WhileController" testname="Poll Until Slot Acquired" enabled="true">
            <stringProp name="WhileController.condition">${__groovy(vars.get("still_waiting") == "true")}</stringProp>
          </WhileController>
          <hashTree>

            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Poll Interval 3-5s" enabled="true">
              <stringProp name="ConstantTimer.delay">3000</stringProp>
              <stringProp name="RandomTimer.range">2000</stringProp>
            </UniformRandomTimer>
            <hashTree/>

            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /form/${form_type} (poll)" enabled="true">
              <stringProp name="HTTPSampler.path">/form/${form_type}</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                <collectionProp name="Arguments.arguments"/>
              </elementProp>
            </HTTPSamplerProxy>
            <hashTree>
              <!-- Check if still in WR or acquired slot -->
              <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Check WR Status" enabled="true">
                <stringProp name="cacheKey">true</stringProp>
                <stringProp name="scriptLanguage">groovy</stringProp>
                <stringProp name="script">
def body = prev.getResponseDataAsString() ?: ""
// Match k6 isWaitingRoomPage — CF native markers + custom WR strings only
def isWr = body.contains("Waiting Room powered by Cloudflare") ||
           body.contains("waitingrooms-text") ||
           body.contains("\u0e04\u0e38\u0e13\u0e2d\u0e22\u0e39\u0e48\u0e43\u0e19\u0e04\u0e34\u0e27") ||
           body.contains("\u0e1c\u0e39\u0e49\u0e40\u0e02\u0e49\u0e32\u0e43\u0e0a\u0e49\u0e40\u0e15\u0e47\u0e21")

if (!isWr) {
    vars.put("still_waiting", "false")
    def elapsed = (System.currentTimeMillis() - (vars.get("poll_start") as long)) / 1000.0
    synchronized (props) {
        def q2a = (props.get("queue_to_active") ?: "0") as int
        props.put("queue_to_active", String.valueOf(q2a + 1))
    }
    log.info("[Thread ${ctx.getThreadNum()}] ACQUIRED SLOT after ${String.format('%.1f', elapsed)}s")
} else {
    // Check timeout
    def elapsed = System.currentTimeMillis() - (vars.get("poll_start") as long)
    def timeout = (vars.get("POLL_TIMEOUT") ?: "180") as long
    if (elapsed > timeout * 1000) {
        vars.put("still_waiting", "false")
        synchronized (props) {
            def t = (props.get("queue_timeout") ?: "0") as int
            props.put("queue_timeout", String.valueOf(t + 1))
        }
        log.warn("[Thread ${ctx.getThreadNum()}] POLL TIMEOUT after ${elapsed/1000}s — giving up")
    }
}
                </stringProp>
              </JSR223PostProcessor>
              <hashTree/>
            </hashTree>

          </hashTree>

          <!-- After acquiring slot: think → submit -->
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think 2-4s (post-acquire)" enabled="true">
            <stringProp name="ConstantTimer.delay">2000</stringProp>
            <stringProp name="RandomTimer.range">2000</stringProp>
          </UniformRandomTimer>
          <hashTree/>

          <!-- Build payload also sets submit_think_min_ms / submit_think_range_ms -->
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Build Submit Payload (queue)" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="filename">groovy/build-payload.groovy</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>

          <!-- Second think time (matches k6 submitAndCheck): 2-5s non-file, 3-7s with file -->
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Submit Think (dynamic)" enabled="true">
            <stringProp name="ConstantTimer.delay">${submit_think_min_ms}</stringProp>
            <stringProp name="RandomTimer.range">${submit_think_range_ms}</stringProp>
          </UniformRandomTimer>
          <hashTree/>

          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /submit/${form_type} (queued)" enabled="true">
            <stringProp name="HTTPSampler.path">/submit/${form_type}</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="fullName" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.name">fullName</stringProp><stringProp name="Argument.value">${full_name}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp></elementProp>
                <elementProp name="email" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.name">email</stringProp><stringProp name="Argument.value">${email}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp></elementProp>
                <elementProp name="phone" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.name">phone</stringProp><stringProp name="Argument.value">${phone}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp></elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Attach Extra Fields + File" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="filename">groovy/attach-fields.groovy</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PreProcessor>
            <hashTree/>

            <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Assert submit + count WR-blocked" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="filename">groovy/submit-assert.groovy</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223Assertion>
            <hashTree/>
          </hashTree>

        </hashTree>

      </hashTree>

      <!-- ═══ tearDown: write WR summary ═══ -->
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="tearDown - WR Summary" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true">
          <intProp name="LoopController.loops">1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
      </PostThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Write WR Summary" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="filename">groovy/wr-summary.groovy</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>

      <!-- ═══ Listeners ═══ -->
      <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/wr-first-hit.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/wr-aggregate.csv</stringProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>